Group By Mechanics

In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [2]:
df

  key1 key2     data1     data2
0    a  one -0.053573  1.587911
1    a  two  0.481575 -1.111329
2    b  one  0.997296  1.666703
3    b  two  0.010641 -0.905483
4    a  one  0.598070  0.794491

In [3]:
grouped = df['data1'].groupby(df['key1'])

In [4]:
grouped

In [5]:
grouped.mean()

key1
a    0.342024
b    0.503968
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [7]:
means

key1  key2
a     one     0.272249
      two     0.481575
b     one     0.997296
      two     0.010641
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a     0.272249  0.481575
b     0.997296  0.010641

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [11]:
df['data1'].groupby([states, years]).mean()

California  2005    0.481575
            2006    0.997296
Ohio        2005   -0.021466
            2006    0.598070
Name: data1, dtype: float64

In [12]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.342024  0.423691
b     0.503968  0.380610

In [13]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.272249  1.191201
     two   0.481575 -1.111329
b    one   0.997296  1.666703
     two   0.010641 -0.905483

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

Iterating Over Groups

In [15]:
df.groupby('key1')

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.053573  1.587911
1    a  two  0.481575 -1.111329
4    a  one  0.598070  0.794491
b
  key1 key2     data1     data2
2    b  one  0.997296  1.666703
3    b  two  0.010641 -0.905483

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
       print((k1, k2))
       print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.053573  1.587911
4    a  one  0.598070  0.794491
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.481575 -1.111329
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.997296  1.666703
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.010641 -0.905483

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.997296  1.666703
3    b  two  0.010641 -0.905483

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

In [22]:
for dtype, grop in grouped:
    print(dtype)
    print(group)

float64
  key1 key2     data1     data2
3    b  two  0.010641 -0.905483
object
  key1 key2     data1     data2
3    b  two  0.010641 -0.905483

In [23]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.191201
     two  -1.111329
b    one   1.666703
     two  -0.905483

In [24]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [25]:
s_grouped

In [26]:
s_grouped.mean()

key1  key2
a     one     1.191201
      two    -1.111329
b     one     1.666703
      two    -0.905483
Name: data2, dtype: float64

In [27]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns = ['a', 'b', 'c', 'd', 'e'],
                      index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [28]:
people.iloc[2:3, [1, 2]] = np.nan

In [29]:
people

               a         b         c         d         e
Joe    -0.462046 -0.882483 -0.873639 -0.971010 -0.674035
Steve  -0.196109  0.727287 -1.778093 -0.221062 -2.032916
Wes     0.393928       NaN       NaN  0.959627  1.725623
Jim    -0.526027 -0.699992 -0.506133  1.457789  1.059166
Travis  1.356843  0.100331  0.310192  1.308986 -0.705667

In [30]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

In [31]:
by_column = people.groupby(mapping, axis = 1)

In [32]:
by_column.sum()

            blue       red
Joe    -1.844649 -2.018564
Steve  -1.999155 -1.501738
Wes     0.959627  2.119551
Jim     0.951657 -0.166853
Travis  1.619178  0.751507

In [33]:
map_series = pd.Series(mapping)

In [34]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [35]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [36]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.594144 -1.582474 -1.379771  1.446406  2.110753
5 -0.196109  0.727287 -1.778093 -0.221062 -2.032916
6  1.356843  0.100331  0.310192  1.308986 -0.705667

In [37]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [38]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.462046 -0.882483 -0.873639 -0.971010 -0.674035
  two -0.526027 -0.699992 -0.506133  1.457789  1.059166
5 one -0.196109  0.727287 -1.778093 -0.221062 -2.032916
6 two  1.356843  0.100331  0.310192  1.308986 -0.705667

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                   names = ['cty', 'tenor'])

In [40]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [41]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.875753 -1.497041  0.265549  0.572802  1.604539
1      0.070707  0.954469  2.024506 -0.884431  0.662909
2      0.160699 -1.062566 -1.570986  0.120830 -0.476031
3     -0.793788  1.130359  0.531495 -0.819323  0.718989

In [42]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

Dta Aggregation

In [43]:
df

  key1 key2     data1     data2
0    a  one -0.053573  1.587911
1    a  two  0.481575 -1.111329
2    b  one  0.997296  1.666703
3    b  two  0.010641 -0.905483
4    a  one  0.598070  0.794491

In [44]:
grouped = df.groupby('key1')

In [45]:
grouped['data1'].quantile(0.9)

key1
a    0.574771
b    0.898631
Name: data1, dtype: float64

In [46]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [47]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.651644  2.699240
b     0.986656  2.572187

In [48]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.342024  0.347514 -0.053573  0.214001  0.481575  0.539823
b      2.0  0.503968  0.697671  0.010641  0.257304  0.503968  0.750632

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.598070   3.0  0.423691  1.387297 -1.111329 -0.158419  0.794491
b     0.997296   2.0  0.380610  1.818811 -0.905483 -0.262437  0.380610


           75%       max
key1
a     1.191201  1.587911
b     1.023657  1.666703

Column-Wise and Multiple Function Application

In [49]:
tips = pd.read_csv('ex2.csv')

In [50]:
tips

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [51]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [52]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [53]:
grouped = tips.groupby(['day', 'smoker'])

In [54]:
grouped_pct = grouped['tip_pct']

In [55]:
grouped_pct.agg('mean')

day  smoker
Sun  No        0.143234
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                mean       std  peak_to_peak
day smoker
Sun No      0.143234  0.044135      0.126793

In [58]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                 foo       bar
day smoker
Sun No      0.143234  0.044135

In [59]:
functions = ['count', 'mean', 'max']

In [60]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [61]:
result

           tip_pct                    total_bill
             count      mean      max      count       mean    max
day smoker
Sun No           6  0.143234  0.18624          6  20.316667  25.29

In [62]:
result['tip_pct']

            count      mean      max
day smoker
Sun No          6  0.143234  0.18624

In [63]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [64]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                tip_pct              total_bill
           Durchschnitt Abweichung Durchschnitt Abweichung
day smoker
Sun No         0.143234   0.001948    20.316667  33.077747

In [65]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

             tip  size
day smoker
Sun No      4.71    18

In [66]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

             tip_pct                              size
                 min      max      mean       std  sum
day smoker
Sun No      0.059447  0.18624  0.143234  0.044135   18

Returning Aggregated Data Without Row Indexes

In [67]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

   day smoker  total_bill       tip  size   tip_pct
0  Sun     No   20.316667  2.966667     3  0.143234

Apply: General split-apply-combine

In [68]:
def top(df, n=5, column='tip_pct'):
         return df.sort_values(by=column)[-n:]

In [69]:
top(tips, n=6)

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [70]:
tips.groupby('smoker').apply(top)

          total_bill   tip smoker  day    time  size   tip_pct
smoker
No     3       23.68  3.31     No  Sun  Dinner     2  0.139780
       4       24.59  3.61     No  Sun  Dinner     4  0.146808
       1       10.34  1.66     No  Sun  Dinner     3  0.160542
       2       21.01  3.50     No  Sun  Dinner     3  0.166587
       5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [71]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

              total_bill   tip smoker  day    time  size  tip_pct
smoker day
No     Sun 5       25.29  4.71     No  Sun  Dinner     4  0.18624

In [72]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [73]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,6.0,0.143234,0.044135,0.059447,0.141537,0.153675,0.165076,0.18624

In [74]:
result.unstack('smoker')

       smoker
count  No        6.000000
mean   No        0.143234
std    No        0.044135
min    No        0.059447
25%    No        0.141537
50%    No        0.153675
75%    No        0.165076
max    No        0.186240
dtype: float64

Suppressing the Group Keys

In [75]:
tips.groupby('smoker', group_keys=False).apply(top)

   total_bill   tip smoker  day    time  size   tip_pct
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
5       25.29  4.71     No  Sun  Dinner     4  0.186240

Quantile and Bucket Analysis

In [76]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [77]:
quartiles = pd.cut(frame.data1, 4)

In [78]:
quartiles[:10]

0    (-1.539, 0.00189]
1     (-3.086, -1.539]
2     (0.00189, 1.543]
3    (-1.539, 0.00189]
4     (0.00189, 1.543]
5    (-1.539, 0.00189]
6    (-1.539, 0.00189]
7     (-3.086, -1.539]
8    (-1.539, 0.00189]
9    (-1.539, 0.00189]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.086, -1.539] < (-1.539, 0.00189] < (0.00189, 1.543] < (1.543, 3.084]]

In [79]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
             'count': group.count(), 'mean': group.mean()}

In [80]:
grouped = frame.data2.groupby(quartiles)

In [81]:
grouped.apply(get_stats).unstack()

                   count       max      mean       min
data1
(-3.086, -1.539]    60.0  2.732908 -0.026906 -2.110540
(-1.539, 0.00189]  452.0  2.938497 -0.038145 -2.638413
(0.00189, 1.543]   428.0  2.939962  0.009343 -3.471077
(1.543, 3.084]      60.0  2.020450 -0.234189 -2.341953

In [82]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [83]:
grouped = frame.data2.groupby(grouping)

In [84]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.732908 -0.024552 -2.362612
1      100.0  2.821820 -0.011194 -2.638413
2      100.0  2.081946 -0.185221 -1.995690
3      100.0  2.938497  0.064105 -2.286526
4      100.0  2.438350 -0.030140 -2.202257
5      100.0  2.819596  0.147842 -1.955473
6      100.0  2.514871 -0.006998 -2.787703
7      100.0  2.939962 -0.197963 -3.471077
8      100.0  1.781663  0.086368 -1.769657
9      100.0  2.020450 -0.131332 -2.341953

Example: Filling Missing Values with Group-Specific Values

In [85]:
s = pd.Series(np.random.randn(6))

In [87]:
s[::2] = np.nan

In [88]:
s

0         NaN
1   -0.153034
2         NaN
3   -0.371084
4         NaN
5   -1.157940
dtype: float64

In [89]:
s.fillna(s.mean())

0   -0.560686
1   -0.153034
2   -0.560686
3   -0.371084
4   -0.560686
5   -1.157940
dtype: float64

In [90]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [91]:
group_key = ['East'] * 4 + ['West'] * 4

In [92]:
data = pd.Series(np.random.randn(8), index=states)

In [93]:
data

Ohio         -0.190860
New York      1.596049
Vermont      -1.105663
Florida       1.735639
Oregon        0.771029
Nevada       -0.292702
California    0.592179
Idaho        -0.406604
dtype: float64

In [94]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [95]:
data

Ohio         -0.190860
New York      1.596049
Vermont            NaN
Florida       1.735639
Oregon        0.771029
Nevada             NaN
California    0.592179
Idaho              NaN
dtype: float64

In [96]:
data.groupby(group_key).mean()

East    1.046943
West    0.681604
dtype: float64

In [97]:
fill_mean = lambda g: g.fillna(g.mean())

In [98]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.190860
New York      1.596049
Vermont       1.046943
Florida       1.735639
Oregon        0.771029
Nevada        0.681604
California    0.592179
Idaho         0.681604
dtype: float64

In [99]:
fill_values = {'East': 0.5, 'West': -1}

In [100]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [101]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.190860
New York      1.596049
Vermont       0.500000
Florida       1.735639
Oregon        0.771029
Nevada       -1.000000
California    0.592179
Idaho        -1.000000
dtype: float64

Example: Random Sampling and Permutation

In [104]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
     cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [105]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [108]:
def draw(deck, n = 5):
    return deck.sample(n)

In [109]:
draw(deck)

5H      5
10S    10
7C      7
2C      2
7S      7
dtype: int64

In [110]:
get_suit = lambda card: card[-1]

In [111]:
deck.groupby(get_suit).apply(draw, n=2)

C  5C     5
   JC    10
D  JD    10
   AD     1
H  JH    10
   2H     2
S  AS     1
   KS    10
dtype: int64

In [112]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

KC    10
AC     1
5D     5
AD     1
5H     5
3H     3
QS    10
6S     6
dtype: int64

Example: Group Weighted Average and Correlation

In [113]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                   'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [114]:
df

  category      data   weights
0        a  1.142588  0.358708
1        a  0.444413  0.855960
2        a  0.504765  0.084991
3        a -0.931081  0.952258
4        b  0.129200  0.641721
5        b -1.516619  0.624509
6        b  0.276209  0.257798
7        b -0.052751  0.800672

In [115]:
grouped = df.groupby('category')

In [116]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [117]:
grouped.apply(get_wavg)

category
a   -0.023745
b   -0.359299
dtype: float64

In [118]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)

FileNotFoundError: [Errno 2] File b'examples/stock_px_2.csv' does not exist: b'examples/stock_px_2.csv'